fixture/vcr_cassettes/Stripe.EventsTest/list_with_key.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/events?limit=5"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"evt_8qzjrJHX6QF4R2\",\n      \"object\": \"event\",\n      \"api_version\": \"2016-07-06\",\n      \"created\": 1469009735,\n      \"data\": {\n        \"object\": {\n          \"id\": \"card_8qzjbcOCnx0sD8\",\n          \"object\": \"card\",\n          \"address_city\": null,\n          \"address_country\": null,\n          \"address_line1\": null,\n          \"address_line1_check\": null,\n          \"address_line2\": null,\n          \"address_state\": null,\n          \"address_zip\": null,\n          \"address_zip_check\": null,\n          \"brand\": \"Visa\",\n          \"country\": \"US\",\n          \"customer\": \"cus_8qzjMPCdcrOe8G\",\n          \"cvc_check\": \"pass\",\n          \"dynamic_last4\": null,\n          \"exp_month\": 1,\n          \"exp_year\": 2018,\n          \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n          \"funding\": \"unknown\",\n          \"last4\": \"1111\",\n          \"metadata\": {},\n          \"name\": \"Joe Test User\",\n          \"tokenization_method\": null\n        }\n      },\n      \"livemode\": false,\n      \"pending_webhooks\": 0,\n      \"request\": \"req_8qzjQdtMGJoe0T\",\n      \"type\": \"customer.source.created\"\n    },\n    {\n      \"id\": \"evt_8qzjZW37Nl8Lbg\",\n      \"object\": \"event\",\n      \"api_version\": \"2016-07-06\",\n      \"created\": 1469009735,\n      \"data\": {\n        \"object\": {\n          \"id\": \"cus_8qzjMPCdcrOe8G\",\n          \"object\": \"customer\",\n          \"account_balance\": 0,\n          \"created\": 1469009735,\n          \"currency\": null,\n          \"default_source\": \"card_8qzjbcOCnx0sD8\",\n          \"delinquent\": false,\n          \"description\": \"Test Account\",\n          \"discount\": null,\n          \"email\": \"events_test6@localhost\",\n          \"livemode\": false,\n          \"metadata\": {},\n          \"shipping\": null,\n          \"sources\": {\n            \"object\": \"list\",\n            \"data\": [\n              {\n                \"id\": \"card_8qzjbcOCnx0sD8\",\n                \"object\": \"card\",\n                \"address_city\": null,\n                \"address_country\": null,\n                \"address_line1\": null,\n                \"address_line1_check\": null,\n                \"address_line2\": null,\n                \"address_state\": null,\n                \"address_zip\": null,\n                \"address_zip_check\": null,\n                \"brand\": \"Visa\",\n                \"country\": \"US\",\n                \"customer\": \"cus_8qzjMPCdcrOe8G\",\n                \"cvc_check\": \"pass\",\n                \"dynamic_last4\": null,\n                \"exp_month\": 1,\n                \"exp_year\": 2018,\n                \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n                \"funding\": \"unknown\",\n                \"last4\": \"1111\",\n                \"metadata\": {},\n                \"name\": \"Joe Test User\",\n                \"tokenization_method\": null\n              }\n            ],\n            \"has_more\": false,\n            \"total_count\": 1,\n            \"url\": \"/v1/customers/cus_8qzjMPCdcrOe8G/sources\"\n          },\n          \"subscriptions\": {\n            \"object\": \"list\",\n            \"data\": [],\n            \"has_more\": false,\n            \"total_count\": 0,\n            \"url\": \"/v1/customers/cus_8qzjMPCdcrOe8G/subscriptions\"\n          }\n        }\n      },\n      \"livemode\": false,\n      \"pending_webhooks\": 0,\n      \"request\": \"req_8qzjQdtMGJoe0T\",\n      \"type\": \"customer.created\"\n    },\n    {\n      \"id\": \"evt_8qzjjSeUAwqj2x\",\n      \"object\": \"event\",\n      \"api_version\": \"2016-07-06\",\n      \"created\": 1469009734,\n      \"data\": {\n        \"object\": {\n          \"id\": \"card_8qzjaaXeActSme\",\n          \"object\": \"card\",\n          \"address_city\": null,\n          \"address_country\": null,\n          \"address_line1\": null,\n          \"address_line1_check\": null,\n          \"address_line2\": null,\n          \"address_state\": null,\n          \"address_zip\": null,\n          \"address_zip_check\": null,\n          \"brand\": \"Visa\",\n          \"country\": \"US\",\n          \"customer\": \"cus_8qzj9zsFTnmzyW\",\n          \"cvc_check\": \"pass\",\n          \"dynamic_last4\": null,\n          \"exp_month\": 1,\n          \"exp_year\": 2018,\n          \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n          \"funding\": \"unknown\",\n          \"last4\": \"1111\",\n          \"metadata\": {},\n          \"name\": \"Joe Test User\",\n          \"tokenization_method\": null\n        }\n      },\n      \"livemode\": false,\n      \"pending_webhooks\": 0,\n      \"request\": \"req_8qzj7hPX199QW6\",\n      \"type\": \"customer.source.created\"\n    },\n    {\n      \"id\": \"evt_8qzj8cPm3kwXFn\",\n      \"object\": \"event\",\n      \"api_version\": \"2016-07-06\",\n      \"created\": 1469009734,\n      \"data\": {\n        \"object\": {\n          \"id\": \"cus_8qzj9zsFTnmzyW\",\n          \"object\": \"customer\",\n          \"account_balance\": 0,\n          \"created\": 1469009734,\n          \"currency\": null,\n          \"default_source\": \"card_8qzjaaXeActSme\",\n          \"delinquent\": false,\n          \"description\": \"Test Account\",\n          \"discount\": null,\n          \"email\": \"events_test5@localhost\",\n          \"livemode\": false,\n          \"metadata\": {},\n          \"shipping\": null,\n          \"sources\": {\n            \"object\": \"list\",\n            \"data\": [\n              {\n                \"id\": \"card_8qzjaaXeActSme\",\n                \"object\": \"card\",\n                \"address_city\": null,\n                \"address_country\": null,\n                \"address_line1\": null,\n                \"address_line1_check\": null,\n                \"address_line2\": null,\n                \"address_state\": null,\n                \"address_zip\": null,\n                \"address_zip_check\": null,\n                \"brand\": \"Visa\",\n                \"country\": \"US\",\n                \"customer\": \"cus_8qzj9zsFTnmzyW\",\n                \"cvc_check\": \"pass\",\n                \"dynamic_last4\": null,\n                \"exp_month\": 1,\n                \"exp_year\": 2018,\n                \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n                \"funding\": \"unknown\",\n                \"last4\": \"1111\",\n                \"metadata\": {},\n                \"name\": \"Joe Test User\",\n                \"tokenization_method\": null\n              }\n            ],\n            \"has_more\": false,\n            \"total_count\": 1,\n            \"url\": \"/v1/customers/cus_8qzj9zsFTnmzyW/sources\"\n          },\n          \"subscriptions\": {\n            \"object\": \"list\",\n            \"data\": [],\n            \"has_more\": false,\n            \"total_count\": 0,\n            \"url\": \"/v1/customers/cus_8qzj9zsFTnmzyW/subscriptions\"\n          }\n        }\n      },\n      \"livemode\": false,\n      \"pending_webhooks\": 0,\n      \"request\": \"req_8qzj7hPX199QW6\",\n      \"type\": \"customer.created\"\n    },\n    {\n      \"id\": \"evt_8qzjmUKskiSMg2\",\n      \"object\": \"event\",\n      \"api_version\": \"2016-07-06\",\n      \"created\": 1469009734,\n      \"data\": {\n        \"object\": {\n          \"id\": \"card_8qzj7yM6JGkjwr\",\n          \"object\": \"card\",\n          \"address_city\": null,\n          \"address_country\": null,\n          \"address_line1\": null,\n          \"address_line1_check\": null,\n          \"address_line2\": null,\n          \"address_state\": null,\n          \"address_zip\": null,\n          \"address_zip_check\": null,\n          \"brand\": \"Visa\",\n          \"country\": \"US\",\n          \"customer\": \"cus_8qzju7uxJ2DohK\",\n          \"cvc_check\": \"pass\",\n          \"dynamic_last4\": null,\n          \"exp_month\": 1,\n          \"exp_year\": 2018,\n          \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n          \"funding\": \"unknown\",\n          \"last4\": \"1111\",\n          \"metadata\": {},\n          \"name\": \"Joe Test User\",\n          \"tokenization_method\": null\n        }\n      },\n      \"livemode\": false,\n      \"pending_webhooks\": 0,\n      \"request\": \"req_8qzjIXa9njQFfx\",\n      \"type\": \"customer.source.created\"\n    }\n  ],\n  \"has_more\": true,\n  \"url\": \"/v1/events\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 10:15:36 GMT",
        "Content-Type": "application/json",
        "Content-Length": "7607",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qzjkAD1i8W8uM",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]